# St7SetBeamLighting

Sets the state of the Lighting options for beam rendering.

long St7SetBeamLighting(long uID, bool FillLighting, bool LineLighting)

Input Parameters

uID

Strand7 model file ID.

FillLighting

The lighting option for beam fill; either True or False.

LineLighting

The lighting option for beam outlines; either True or False.